In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
df=sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [2]:
#1.how many passengers travelled through embarked S
len(df[df["embarked"]=="S"])

644

In [3]:
#2.how many passengers spent maximum fare
len(df[df["fare"]==df["fare"].max()])

3

In [4]:
#how many passengers whose age is either >30 or fare spent by the passenger is maximum
df[(df["fare"]==df["fare"].max())|(df["age"]>30)] #find count

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
873,0,3,male,47.0,0,0,9.0000,S,Third,man,True,NaN,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
881,0,3,male,33.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [5]:
len(df[(df["fare"]==df["fare"].max())|(df["age"]>30)])

305

In [6]:
#replace function: for encoding in ML
df["sex"]=df["sex"].replace({"male":"M"})

In [7]:
df["sex"] #encoding/ column transform

0           M
1      female
2      female
3      female
4           M
        ...
886         M
887    female
888    female
889         M
890         M
Name: sex, Length: 891, dtype: object

In [8]:
df["sex"]=df["sex"].replace({"female":"F"})

In [10]:
#find the no. of males and females
df["sex"].value_counts()

M    577
F    314
Name: sex, dtype: int64

In [11]:
#how many passengers of each pclass
df["pclass"].value_counts()

3    491
1    216
2    184
Name: pclass, dtype: int64

In [13]:
#group by: for grouping data according to categories
#find out the avg fare spent by male & female
y=df.groupby("sex")["fare"].mean()
y

sex
F    44.479818
M    25.523893
Name: fare, dtype: float64

In [15]:
#find min, max, and avg fare spent by male & female
x=df.groupby("sex")["fare"].agg(["min","max","mean"]) #agg for giving multiple fns
x

      min       max       mean
sex
F    6.75  512.3292  44.479818
M    0.00  512.3292  25.523893

In [17]:
## total fare spent by male and female
df.groupby("sex")["fare"].sum()

sex
F    13966.6628
M    14727.2865
Name: fare, dtype: float64

In [19]:
## avg fare spent by each passenger class
df.groupby("pclass")["fare"].mean()

pclass
1    84.154687
2    20.662183
3    13.675550
Name: fare, dtype: float64

In [21]:
# find the avg fare of male and female per each class
# by making multiple groups
df.groupby(["sex","pclass"])["fare"].agg(["mean","min","max"])

                  mean      min       max
sex pclass
F   1       106.125798  25.9292  512.3292
    2        21.970121  10.5000   65.0000
    3        16.118810   6.7500   69.5500
M   1        67.226127   0.0000  512.3292
    2        19.741782   0.0000   73.5000
    3        12.661633   0.0000   69.5500

In [22]:
# how many people survived or died
df["survived"].value_counts()

0    549
1    342
Name: survived, dtype: int64

In [23]:
#how many males and females survived or not
df.groupby("sex")["survived"].value_counts()

sex  survived
F    1           233
     0            81
M    0           468
     1           109
Name: survived, dtype: int64

In [24]:
#how many males and females of each class
df.groupby("pclass")["sex"].value_counts()

pclass  sex
1       M      122
        F       94
2       M      108
        F       76
3       M      347
        F      144
Name: sex, dtype: int64

In [25]:
# how many people survived of each class
df.groupby("pclass")["survived"].value_counts()

pclass  survived
1       1           136
        0            80
2       0            97
        1            87
3       0           372
        1           119
Name: survived, dtype: int64

In [26]:
# how many males and females survived of each class
df.groupby(["sex","pclass"])["survived"].value_counts()

sex  pclass  survived
F    1       1            91
             0             3
     2       1            70
             0             6
     3       0            72
             1            72
M    1       0            77
             1            45
     2       0            91
             1            17
     3       0           300
             1            47
Name: survived, dtype: int64